basic-chromium/diagram2.dot
digraph with_testing {

    graph [
        bgcolor="white",
        rankdir=LR,
        splines=ortho,
        nodesep=0.7,
        ranksep=0.8
    ];

    node [
        shape=box,
        style="rounded",
        fontsize=18,
        fontname="Helvetica"
    ];

    edge [
        penwidth=1.5,
        arrowsize=0.8
    ];

    W [label="W"]; // Windows machine 

    subgraph cluster_L {
        label="L"; // Linux Developer machine
        style="rounded";
        color="gray40";
        penwidth=2;

        subgraph cluster_docker {
            label=""; // Container cluster (Docker/Podman/Kubernetes)
            style="rounded,dashed";
            color="gray65";

            C [label="🌐\nC"]; // Chrome Browser/Selenium observer
            F [label="F"]; // Application Front End
            B [label="B"]; // Application Back End
            D [label="D"]; // Application Database
        }
    }

    W -> L; // SSH

    C -> F; // Web

    F -> B ; // REST
    
    B -> F [ // WebSocket
        style=dashed,
        constraint=false
    ]; 

    B -> D; // JDBC

    C -> L [ // Volume, Logs
        style=dotted,
        arrowhead=none,
        splines=polyline,
        constraint=false
    ];
}
